# Segment Override Type Enumeration

Source: https://www.revitapidocs.com/2026/de74a4fc-fb27-ee1f-84e7-2fd3974aaec0.htm

---

| Segment Override Type Enumeration |
| --- |

The override types of analytical segment pressure drop calculation.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum SegmentOverrideType
```

```
Public Enumeration SegmentOverrideType
```

```
public enum class SegmentOverrideType
```

```
type SegmentOverrideType
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| None | 0 | The segment calculation is not overridden. |
| OverrideLossCoefficient | 1 | The segment loss coefficient is overridden. |
| OverridePressureDrop | 2 | The segment pressure drop is overridden. |

See Also

#### Reference

Autodesk.Revit.DB.Analysis Namespace